[
  {
    "bookId": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co.com/7xwL9Yc6/Well-do-th-repairs-for-you.png",
    "review": "A psychological thriller with an unpredictable twist. The story revolves around Alicia Berenson, a famous painter who inexplicably stops speaking after a shocking event. Her silence becomes the center of a gripping mystery that keeps readers on edge. The narrative is masterfully crafted, with layers of suspense and psychological depth. Each chapter reveals new clues, making it impossible to put the book down. The ending is both shocking and satisfying, leaving readers in awe. This book is a must-read for fans of thrillers and mysteries.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological", "Mystery"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "bookId": 2,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://i.ibb.co.com/1Y4cg9JH/Atomic-Habits-An-Easy-Proven-Way-to-Build-Good-Habits-Break-Bad-Ones-1.jpg",
    "review": "An excellent guide to building good habits and breaking bad ones. James Clear provides practical strategies backed by science to help readers transform their lives. The book emphasizes the power of small changes and how they compound over time to yield significant results. Clear's writing is clear, concise, and filled with actionable advice. He also shares inspiring stories of individuals who have successfully implemented these principles. Whether you're looking to improve your health, productivity, or relationships, this book offers valuable insights. It's a timeless resource for personal growth and self-improvement.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Self-Help",
    "tags": ["Productivity", "Motivation", "Personal Growth"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 3,
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co.com/Sw5Z4mTZ/9781472158666.webp",
    "review": "A beautifully written novel blending mystery and romance. The story follows Kya Clark, known as the 'Marsh Girl,' who grows up isolated in the marshes of North Carolina. Owens' vivid descriptions bring the natural world to life, making the setting almost a character itself. The narrative alternates between Kya's coming-of-age story and a murder investigation, creating a perfect balance of suspense and emotion. The characters are deeply relatable, and the themes of loneliness, resilience, and love resonate strongly. The ending is both poignant and unforgettable. This book is a masterpiece that stays with you long after the last page.",
    "totalPages": 368,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Mystery", "Romance", "Coming of Age"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 4,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co.com/W8K7J86/7b87021301ba936ccf5e34b7a1e43015.jpg",
    "review": "A fascinating journey through the history of human civilization. Harari explores how Homo sapiens evolved and dominated the planet, covering key milestones like the Cognitive Revolution, Agricultural Revolution, and Scientific Revolution. His ability to connect historical events with modern-day issues is both enlightening and thought-provoking. The book challenges readers to rethink their understanding of society, culture, and progress. Harari's writing is engaging and accessible, making complex ideas easy to grasp. This book is a must-read for anyone interested in anthropology, history, or the future of humanity. It's a profound and eye-opening experience.",
    "totalPages": 498,
    "rating": 4.6,
    "category": "History",
    "tags": ["Anthropology", "Science", "Society"],
    "publisher": "Harper",
    "yearOfPublishing": 2014
  },
  {
    "bookId": 5,
    "bookName": "The Midnight Library",
    "author": "Matt Haig",
    "image": "https://i.ibb.co.com/XZ0pKKSp/1680179240728.jpg",
    "review": "A thought-provoking novel about choices and second chances. The story follows Nora Seed, who finds herself in a magical library between life and death. Each book in the library represents a different life she could have lived if she had made different choices. Haig explores themes of regret, hope, and the infinite possibilities of life. The writing is heartfelt and deeply moving, with moments of humor and wisdom. The book encourages readers to reflect on their own lives and the paths they've taken. It's a beautiful reminder that it's never too late to change your story. This novel is both uplifting and profound.",
    "totalPages": 304,
    "rating": 4.3,
    "category": "Fantasy",
    "tags": ["Philosophy", "Fantasy", "Self-Discovery"],
    "publisher": "Canongate Books",
    "yearOfPublishing": 2020
  },
  {
    "bookId": 6,
    "bookName": "Dune",
    "author": "Frank Herbert",
    "image": "https://i.ibb.co.com/kVhWWrHh/IMG-2414.jpg",
    "review": "A sci-fi masterpiece with deep world-building and politics. Set in a distant future, the story revolves around the desert planet Arrakis and its valuable resource, spice. Herbert creates a richly detailed universe filled with complex characters and intricate political intrigue. The themes of power, survival, and ecology are explored with remarkable depth. The protagonist, Paul Atreides, undergoes a transformative journey that captivates readers from start to finish. The book's influence on the science fiction genre is undeniable. It's a timeless classic that continues to inspire readers and creators alike. Dune is a must-read for any sci-fi enthusiast.",
    "totalPages": 412,
    "rating": 4.8,
    "category": "Science Fiction",
    "tags": ["Adventure", "Political", "Classic"],
    "publisher": "Chilton Books",
    "yearOfPublishing": 1965
  },
  {
    "bookId": 7,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/6JrdCrVQ/book-The-Alchemist-book.webp",
    "review": "An inspiring tale about following your dreams. The story follows Santiago, a young shepherd who embarks on a journey to find a hidden treasure. Along the way, he learns valuable lessons about life, love, and the pursuit of one's Personal Legend. Coelho's writing is simple yet profound, filled with timeless wisdom. The book encourages readers to listen to their hearts and embrace the unknown. It's a story that resonates with people from all walks of life. The Alchemist is more than just a book; it's a spiritual guide. Its message of hope and perseverance continues to inspire millions worldwide.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Philosophy",
    "tags": ["Spirituality", "Adventure", "Self-Discovery"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 8,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co.com/zhNgYftk/3744438.jpg",
    "review": "A dystopian classic that remains relevant today. Orwell's portrayal of a totalitarian society is both chilling and thought-provoking. The story follows Winston Smith, who struggles against the oppressive regime of Big Brother. Themes of surveillance, censorship, and individuality are explored with striking relevance. The book serves as a warning about the dangers of unchecked power and authoritarianism. Orwell's writing is sharp, compelling, and deeply unsettling. 1984 has left an indelible mark on literature and popular culture. It's a must-read for anyone interested in politics, society, or the human condition. This book is as impactful today as it was when first published.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Dystopian",
    "tags": ["Political", "Classic", "Suspense"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 9,
    "bookName": "Becoming",
    "author": "Michelle Obama",
    "image": "https://i.ibb.co.com/whnKTBc7/prison-journalism-obama-becoming-review-111822.webp",
    "review": "An intimate and powerful memoir from the former First Lady. Michelle Obama shares her journey from her childhood in Chicago to her years in the White House. Her story is one of resilience, determination, and authenticity. The book offers a behind-the-scenes look at her life, including the challenges and triumphs she faced. Obama's writing is candid, warm, and inspiring. She reflects on her role as a mother, wife, and public figure with grace and humility. Becoming is not just a memoir; it's a call to action for readers to embrace their own stories. This book is a testament to the power of hope and hard work.",
    "totalPages": 448,
    "rating": 4.9,
    "category": "Memoir",
    "tags": ["Biography", "Inspiration", "Leadership"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 10,
    "bookName": "Rich Dad Poor Dad",
    "author": "Robert Kiyosaki",
    "image": "https://i.ibb.co.com/whCDNrMS/Buy-Rich-Dad-Poor-Dadin-Philippines.webp",
    "review": "A must-read for financial literacy and mindset shift. Kiyosaki shares lessons he learned from his two 'dads'—his biological father (Poor Dad) and his best friend's father (Rich Dad). The book challenges conventional wisdom about money and investing. It emphasizes the importance of financial education and building assets. Kiyosaki's straightforward advice is both practical and eye-opening. The book has inspired millions to take control of their financial futures. Rich Dad Poor Dad is more than just a book; it's a movement. Its timeless principles continue to empower readers to achieve financial independence.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Finance",
    "tags": ["Money", "Investment", "Mindset"],
    "publisher": "Plata Publishing",
    "yearOfPublishing": 1997
  }
]